fishes_config/src/Documents/ПродажаРыб/ПродажаРыб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаРыб</name>
  <registerRecords>AccumulationRegister.ОстаткиПоРыбам</registerRecords>
  <registerRecords>AccumulationRegister.РегистрПродажи</registerRecords>
  <tabularSections>
    <name>ПродажаРыб_таблица</name>
    <attributes>
      <name>Аквариум</name>
      <type>
        <types>CatalogRef.Аквариумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаРыб</name>
      <type>
        <types>CatalogRef.ПородыРыб</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fishes_config/src/Documents/ПродажаРыб/Forms/ПродажаРыб_форма/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыПродажаРыб_таблица
&НаКлиенте
Процедура ПродажаРыб_таблицаКоличествоПриИзменении(Элемент)
	Строка = Элементы.ПродажаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ПродажаРыб_таблицаЦенаПродажиПриИзменении(Элемент)
	Строка = Элементы.ПродажаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Строка);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСумму(Строка)
	Если ЗначениеЗаполнено(Строка.Количество) И ЗначениеЗаполнено(Строка.ЦенаПокупки) Тогда
		Строка.Сумма = Окр(Строка.Количество * Строка.ЦенаПокупки, 2);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
